export const questions = [
    {
        title: 'Що означає помилка "Stack Overflow"?',
        variants: ['Стек не знайден', 'Стек переповнен', 'Стек зіпсований'],
        correct: 1,
    },
    {
        title: 'Який індекс першого елемента масиву?',
        variants: ['0', '1', '-1'],
        correct: 0,
    },
    {
        title: 'Як називається операція, що збільшує значення змінної?',
        variants: ['Інкремент', 'Компіляція', 'Конкатенація'],
        correct: 0,
    },
    {
        title: 'Хто заснував Microsoft?',
        variants: ['Стів Джобс', 'Білл Гейтс', 'Марк Цукерберг'],
        correct: 1,
    },
    {
        title: 'Вказівник розташування на екрані?',
        variants: ['Піксель', 'Курсор', 'Мишка'],
        correct: 1,
    },
    {
        title: 'Який тег створює гіпертекстові посилання?',
        variants: ['<link>', '<b>', '<a>'],
        correct: 2,
    },
    {
        title: 'Як називається одна з мов програмування?',
        variants: ['Удав', 'Гіббон', 'Пітон'],
        correct: 2,
    },
    {
        title: 'Файл якого типу має розширення PNG?',
        variants: ['Відео', 'Зображення', 'Звук'],
        correct: 1,
    },
    {
        title: 'Пошук, аналіз та усунення помилок називається...?',
        variants: ['Налагодження', 'Компіляція', 'Деплой'],
        correct: 0,
    },
    {
        title: 'Як називається процес перерозподілу фрагментів файлів на диску?',
        variants: ['Форматування', 'Розгортання', 'Дефрагментація'],
        correct: 2,
    },
];
